app/controllers/productos_controller.rb

  def index
    render json:  Producto.all
---
SELECT `productos`.* FROM `productos`

  def create
    @producto = Producto.new(producto_params)


    respond_to do |format|
      if @producto.save
---
INSERT INTO `productos` (`nombre`, `descripcion`, `estado`, `created_at`, `updated_at`) VALUES ('Arroz', 'Arroz Imperio 1800 grms', 'Activo', '2015-04-10 06:30:16.782747', '2015-04-10 06:30:16.782747')

  def set_producto
    @producto = Producto.find(params[:id])
---
SELECT  `productos`.* FROM `productos` WHERE `productos`.`id` = 1 LIMIT 1