app/controllers/products_controller.rb

  def index
    product = Product.all
---
SELECT `products`.* FROM `products`

  def create
    product = Product.new(product_params)
    if product.save
---
INSERT INTO `products` (`name`, `description`, `price`, `state`, `created_at`, `updated_at`) VALUES ('dadasd', 'aaddasd', 1200.0, 1, '2015-04-17 09:52:18.161734', '2015-04-17 09:52:18.161734')

  def show
    product = Product.find(params[:id])
---
SELECT  `products`.* FROM `products` WHERE `products`.`id` = 0 LIMIT 1