app/controllers/users_controller.rb

  def authenticate
    user = User.find_by_user(params[:user])
---
SELECT  `users`.* FROM `users` WHERE `users`.`user` = 'Nacho' LIMIT 1