app/controllers/usuarios_controller.rb

SELECT `usuarios`.* FROM `usuarios`
---
  def index
    @usuarios = Usuario.all

INSERT INTO `usuarios` (`authtoken`, `nombre`, `apellidos`, `nombre_usuario`, `contrasenna`, `created_at`, `updated_at`) VALUES ('21', 'eqwe', 'qweq', 'eqwe', 'eqwe', '2015-04-10 06:04:23.853651', '2015-04-10 06:04:23.853651')
---
  def create
    @usuario = Usuario.new(usuario_params)

    respond_to do |format|
      if @usuario.save

UPDATE `usuarios` SET `nombre` = 'Ignacio', `apellidos` = 'Valerio Vega', `nombre_usuario` = 'Nacho', `contrasenna` = '1', `updated_at` = '2015-04-10 18:17:25.238304' WHERE `usuarios`.`id` = 1
---
  def update
    respond_to do |format|
      if @usuario.update(usuario_params)

SELECT  `usuarios`.* FROM `usuarios` WHERE `usuarios`.`id` = 1 LIMIT 1
---
    def set_usuario
      @usuario = Usuario.find(params[:id])